# добавил папки
a = 5
b = 7
print(a+b) #сумма
print(a-b) #разность
print(a*b) #умножение
print(a**b) #возведение в степень
print(a%b) #деление по модулю
print(a//b) #целочисленное деление

x = 17/2*3+2
x1 = (17/2)*3+2
a = str(print('x =', x, ',', 'x1 =', x1))

x = 2+17/2*3
x1 = 2+(17/2*3)
print('x =', x, ',', 'x1 =', x1)
x = 19%4+15/2*3
x1 = (19%4)+(15/2)*3
print('x =', x, ',', 'x1 =', x1)
x = (15+6)-10*4
x1 = (15+6)-(10*4)
print('x =', x, ',', 'x1 =', x1)
x = 17/2%2*3**3
x1 = (17/2)%2*(3**3)
print('x =', x, ',', 'x1 =', x1)

